Repository: huypham-01/one
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Dashboard
vi: Bảng điều khiển

source: Mold
vi: Khuôn

source: Molding
vi: Khuôn

source: Tuft
vi: Cắm sợi

source: Tufting
vi: Cắm sợi

source: Blister
vi: Đóng gói

source: Blistering
vi: Đóng gói

source: Online
vi: Trực tuyến

source: Warning
vi: Cảnh báo

source: Offline
vi: Ngoại tuyến

source: Total
vi: Tổng cộng

source: Flexible
vi: Linh hoạt

source: Action
vi: Hành động

source: System Settings
vi: Cài đặt hệ thống

source: Language
vi: Ngôn ngữ

source: Select Language
vi: Chọn ngôn ngữ

source: Login
vi: Đăng nhập

source: Logout
vi: Đăng xuất

source: Back
vi: Quay lại

source: Monitoring
vi: Giám sát

# locationMa
source: Location Management
vi: Quản lý vị trí

source: Monitoring Dashboard
vi: Bảng điều khiển giám sát

# addDevice
source: Add New Device
vi: Thêm thiết bị mới

source: Edit Device
vi: Sửa thiết bị

source: Information
vi: Thông Tin

source: Process
vi: Quy trình

source: Mold Cavity
vi: Lỗ khuôn

# moldca
source: Mold Cav.
vi: Lỗ khuôn

source: Actual Cavity
vi: Lỗ thực tế

# actca
source: Act. Cav.
vi: Lỗ T.Tế

source: Capacity
vi: Sản lượng

source: Efficiency
vi: Hiệu suất

source: Eff.requirement
vi: Yêu cầu hiệu suất

source: Current Cycle
vi: Chu kỳ hiện tại

# curcyc
source: Cur. Cycle
vi: C.kỳ hiện tại

source: Target
vi: Mục tiêu

source: Upper Limit
vi: Giới hạn trên

source: Lower Limit
vi: Giới hạn dưới

source: RPM
vi: Vòng/phút

# brushesPerCycle
source: Brushes/cycle
vi: Bàn chải/chu kỳ

source: Pcs/minute
vi: Cái/phút

source: Total lost pcs
vi: Tổng SP lỗi

source: Lost time
vi: Thời gian mất

source: Shot Count
vi: Số lần bắn

source: Total RPM
vi: Tổng vòng/phút

source: Total Cycle
vi: Tổng chu kỳ

source: Total Count
vi: Tổng

source: NO DATA
vi: KHÔNG

source: Add Action
vi: Thêm hành động

source: Hourly Efficiency
vi: Hiệu suất theo giờ

source: Output
vi: Sản lượng

# towdayago
source: 2 day ago
vi: 2 ngày trước

source: Yesterday
vi: Hôm qua

source: Today
vi: Hôm nay

# fromdateline
source: From
vi: Từ ngày

# todateline
source: To
vi: Đến ngày

source: SEARCH
vi: Tìm kiếm

source: RESET
vi: Đặt lại

source: Total Output
vi: Tổng sản lượng

source: Average Cycle
vi: Chu kỳ trung bình

source: Loss & Idle Time Report
vi: Báo cáo thời gian mất & nghỉ

source: Time
vi: Thời gian

source: Lost Pcs
vi: Cái lỗi

# idleBreakdown
source: Idle/Breakdown(s)
vi: Ngừng/Trục trặc (giây)

source: Date Time
vi: Ngày giờ

source: Average Output
vi: Sản lượng trung bình

source: Found
vi: Tìm thấy

source: records
vi: bản ghi

source: Select Date
vi: Chọn ngày

source: Pcs
vi: Cây

source: Cycle
vi: Chu kỳ

source: Output (pcs)
vi: Sản lượng (cái)

# noDataFound
source: DATA NOT FOUND
vi: KHÔNG TÌM THẤY DỮ LIỆU

source: Create new Action
vi: Tạo hành động mới

source: Issue ID
vi: Mã sự cố

source: Issue Description
vi: Mô tả sự cố

source: Issue Type
vi: Loại sự cố

source: Act. Eff.
vi: H.Suất T.Tế

source: Act. Cavity
vi: Lỗ Thực tế

source: Act. Cycle
vi: C.kỳ thực

# effrequired
source: Eff. Req.
vi: HS yêu cầu

source: Priority
vi: Ưu tiên

source: Due
vi: Hạn

source: Creator
vi: Người tạo

source: Action Plans
vi: Kế hoạch hành động

source: Add Plan
vi: Thêm kế hoạch

source: Action ID
vi: Mã hành động

source: Planned completion date
vi: Ngày hoàn thành dự kiến

source: Owner
vi: Người phụ trách

source: Cancel
vi: Hủy

source: Create Action
vi: Tạo hành động

# example
source: Example: John Doe
vi: Ví dụ: John Doe

source: EMS Dashboard
vi: Bảng điều khiển EMS

source: Overall
vi: Tổng quan

source: Running
vi: Đang chạy

source: Breakdown
vi: Sự Cố

source: Average
vi: Trung bình

source: Machine ID
vi: ID Máy

source: Capacity/hr
vi: Công suất/giờ

source: EMS Monitoring
vi: Giám sát EMS

source: Machine Details
vi: Chi tiết máy

source: Efficiency Report
vi: Báo cáo hiệu suất

source: Output Report
vi: Báo cáo sản lượng

source: Output Summary
vi: Tóm tắt sản lượng

source: Lost (pcs)
vi: Mất (cái)

source: All Families
vi: Tất cả loại hàng

source: SubTotal
vi: Tổng phụ

source: Details
vi: Chi tiết

source: Date Shift
vi: Ca ngày

source: Night Shift
vi: Ca đêm

source: Family
vi: Loại hàng

source: Status
vi: Trạng thái

source: All
vi: Tất cả

# sortoption
source: Sort Options
vi: Sắp xếp

source: Select Family
vi: Chọn loại hàng

source: Model
vi: Loại máy

source: Mgf.
vi: Nhà SX

source: Mgf. Date.
vi: Ngày SX

# cavities
source: Cav.
vi: Khoang

source: Cap.(1h)
vi: Sản lượng (1h)

source: Unit
vi: Đơn vị

source: His. Count
vi: SL lịch sử

# limit
source: Limits
vi: Giới hạn

# frecheckconnected
source: Fre. Conn.(s)
vi: Tần suất KN (s)

# frechecklimit
source: Fre. Limit(s)
vi: Tần suất GH (s)

# efflimit
source: Eff. Limit(s)
vi: GH hiệu suất(%)

source: Mold Type
vi: Loại khuôn

source: Low
vi: Thấp

source: Medium
vi: Trung bình

source: High
vi: Cao

source: Urgent
vi: Khẩn cấp

source: Lower
vi: Thấp

source: Upper
vi: Cao

source: Edit
vi: Chỉnh sửa

source: Delete
vi: Xóa

# machineIDuniq
source: Machine ID (unique)
vi: ID Máy (Duy nhất)

# numberofca
source: Number of Cavities
vi: Số khoang

source: Efficiency Limit (%)
vi: Giới Hạn Hiệu Suất (%)

source: History Count
vi: Số Lượng Lịch Sử

# errorLoadData
source: error load data: {error}
vi: Lỗi tải dữ liệu: {error}

source: Loading devices...
vi: Đang tải thiết bị...

# noDevicesFound
source: No devices found in {category}
vi: Không tìm thấy thiết bị trong {category}

source: Machine Type
vi: Loại Máy

# systemTypeHint
source: --System Type--
vi: --Loại máy-

# selectProcessHint
source: --Select Process--
vi: --Chọn Quy Trình--

source: Manufacturer
vi: Nhà Sản Xuất

source: Lower Limit (s)
vi: GH Thấp Nhất (giây)

# targetLimits
source: Target (s)
vi: Mục Tiêu (giây)

source: Upper Limit (s)
vi: GH Cao Nhất (giây)

source: Freq. Chk Conn. (s)
vi: Tần Suất KT Kết Nối (giây)

source: Freq. Chk. Lim. (s)
vi: Giới Hạn KT Tần Suất (giây)

# selectOption
source: -- Select --
vi: -- Chọn --

# deviceAddedSuccess
source: Device added successfully!
vi: Thêm thiết bị thành công!

# deviceUpdatedSuccess
source: Device updated successfully!
vi: Cập nhật thiết bị thành công!

# failedError
source: Failed: {message}
vi: Thất bại: {message}

source: Unknown error
vi: Lỗi không xác định

source: Update Device
vi: Cập Nhật Thiết Bị

# addD
source: Add Device
vi: Thêm Thiết Bị

source: Confirm Delete
vi: Xác Nhận Xóa

# deleteConfirmMsg
source: Are you sure you want to delete device
vi: Bạn có chắc muốn xóa thiết bị

# deleteSuccessMsg
source: {deviceId} deleted
vi: {deviceId} đã xóa

# deleteFailedMsg
source: Delete device failed
vi: Xóa thiết bị thất bại

source: No issues found
vi: Không tìm thấy vấn đề nào

source: No action plans available
vi: Không có kế hoạch hành động nào

# issueType
source: Type
vi: Loại

source: Created Date
vi: Ngày tạo

source: Due Date
vi: Ngày đến hạn

# approvalStatus
source: Approval
vi: Trạng thái

source: Action plan
vi: Kế hoạch

# completeActionTitle
source: Complete Action
vi: Hoàn thành Hành động

source: Complete
vi: Hoàn thành

# completeActionSuccess
source: Complete Action Successfully
vi: Hoàn thành hành động thành công

# completeActionFailed
source: Failed to complete action
vi: Thất bại khi hoàn thành hành động

# errorTitle
source: Error
vi: Lỗi

source: Retry
vi: Thử lại

source: Location Management
vi: Quản lý Vị trí

# errorPrefix
source: Error:
vi: Lỗi:

# deviceIdLabel
source: Device ID
vi: ID Thiết bị

# locationLabel
source: Location
vi: Vị trí

# temperatureLabel
source: Temperature
vi: Nhiệt độ

# humidityLabel
source: Humidity
vi: Độ ẩm

# pressureLabel
source: Pressure
vi: Áp suất

# totalCountLabel
source: Total Count (H)
vi: Tổng Số Lượng (H)

# editLocationTitle
source: Edit Location
vi: Chỉnh Sửa Vị Trí

# locationNameLabel
source: Location Name
vi: Tên Vị Trí

# descriptionLabel
source: Description
vi: Mô Tả

source: Save
vi: Lưu

# locationUpdatedSuccess
source: Location updated successfully
vi: Vị trí đã được cập nhật thành công

# deleteLocationTitle
source: Delete Location
vi: Xóa Vị Trí

# deleteConfirmMsgLoca
source: Are you sure you want to delete ?
vi: Bạn có chắc chắn muốn xóa không?

# deleteIrreversible
source: This action cannot be undone.
vi: Hành động này không thể hoàn tác.

# locationDeletedSuccess
source: Location deleted successfully
vi: Vị trí đã được xóa thành công

# addNewLocationTitle
source: Add New Location
vi: Thêm Vị Trí Mới

source: Add
vi: Thêm

# locationAddedSuccess
source: Location added successfully
vi: Vị trí đã được thêm thành công

source: No locations found
vi: Không tìm thấy vị trí nào

source: Add First Location
vi: Thêm Vị Trí Đầu Tiên

# locationManagementTitle
source: Location Management
vi: Quản Lý Vị Trí

# locationsCount
source: locations
vi: vị trí

source: Loading locations...
vi: Đang tải vị trí...

source: Error loading locations
vi: Lỗi tải vị trí

# selectLocationHint
source: --Select Location--
vi: --Chọn Vị Trí--

source: Frequency (seconds)
vi: Tần suất (giây)

# frequencyCheckLimit
source: Frequency Check Limit (s)
vi: Giới Hạn Kiểm Tra Tần Suất (giây)

# requiredFieldsError
source: Please fill all required fields
vi: Vui lòng điền đầy đủ các trường bắt buộc

source: Add device failed
vi: Thêm thiết bị thất bại

source: Device updated error
vi: Lỗi cập nhật thiết bị

source: Update device failed
vi: Cập nhật thiết bị thất bại

source: Data Frequency
vi: Tần Suất Dữ Liệu

source: Check Limit
vi: Giới Hạn Kiểm Tra

source: Issue
vi: Sự cố

source: -- Select issue type --
vi: -- Chọn loại sự cố --

# enterActionPlan
source: Enter detailed action plan...
vi: Nhập kế hoạch hành động chi tiết...

source: Actual
vi: Thực tế

# actionAddedSuccess
source: Action added successfully
vi: Hành động đã được thêm thành công

# createActionError
source: Failed to create action
vi: Không thể tạo hành động

# searchHint
source: Search by name or code...
vi: Tìm kiếm theo tên hoặc mã...

# searchHintt
source: Search by device / issue / owner...
vi: Tìm kiếm theo thiết bị / sự cố...

# categoryLabel
source: Category
vi: Danh mục

# typeLabel
source: Type
vi: Loại

source: results found
vi: kết quả tìm thấy

source: Clear Filters
vi: Xóa bộ lọc

# loadingInstructions
source: Loading working instructions...
vi: Đang tải hướng dẫn làm việc...

source: Error loading data
vi: Lỗi khi tải dữ liệu

# noInstructionsAvailable
source: No working instructions available
vi: Không có hướng dẫn làm việc nào khả dụng

# refreshButton
source: Refresh
vi: Làm mới

source: No instructions found
vi: Không tìm thấy hướng dẫn nào

# adjustFiltersHint
source: Try adjusting your filters or search terms
vi: Thử điều chỉnh bộ lọc hoặc từ khóa tìm kiếm của bạn

# updatedLabel
source: Updated
vi: Đã cập nhật

# dailyInspectionTitle
source: Daily Inspection
vi: Kiểm tra hàng ngày

source: Need to inspect
vi: Cần kiểm tra

# maintenanceMachineTitle
source: Maintenance Machine
vi: Bảo trì máy

source: Scheduled Today
vi: Lên lịch hôm nay

# equipmentsTitle
source: Equipments
vi: Thiết bị

# overdueTitle
source: Overdue
vi: Quá hạn

source: List Daily Inspection
vi: Danh sách kiểm tra hàng ngày

source: Incomplete
vi: Chưa hoàn thành

source: Completed
vi: Đã hoàn thành

source: Filters
vi: Bộ lọc

# activeFilters
source: active
vi: hoạt động

source: Tasks
vi: Công việc

# filtered
source: Filtered from tasks
vi: Kết quả:

source: No tasks found
vi: Không tìm thấy công việc nào

source: No tasks available
vi: Không có công việc nào khả dụng

# noTasksInCategory
source: No tasks in this category
vi: Không có công việc nào trong danh mục này

# errorLoading
source: Error
vi: Lỗi

source: No inspections found
vi: Không tìm thấy kiểm tra nào

# progressLabel
source: Progress
vi: Tiến độ

source: Detail
vi: Chi tiết

source: Start
vi: Bắt đầu

source: Checklist Form
vi: Biểu mẫu kiểm tra

source: Step
vi: Trang

source: Loading...
vi: Đang tải...

# failedloadvideo
source: Failed to load video
vi: Lỗi khi tải video

source: Upload Image
vi: Chụp ảnh

source: Take Photo
vi: Chụp ảnh

source: Next
vi: Tiếp tục

source: Previous
vi: Trước

source: Submit
vi: Gửi

# formSubmittedSuccess
source: Form has been submitted successfully!
vi: Form đã được gửi thành công!

# formSubmissionFailed
source: Form submission failed. Please try again.
vi: Gửi form thất bại. Vui lòng thử lại.

# incompleteItemsCurrentStep
source: Incomplete Items in Current Step
vi: Các mục chưa hoàn thành trong Bước hiện tại

source: Form Incomplete
vi: Form Chưa Hoàn Thành

# completeItemsBeforeNext
source: Please complete the following items before proceeding to the next step:
vi: Vui lòng hoàn thành các mục sau trước khi chuyển sang bước tiếp theo:

# completeItemsBeforeSubmit
source: The following items need to be completed before submission:
vi: Các mục sau cần được hoàn thành trước khi gửi:

source: Confirmation
vi: Xác Nhận

# confirmCompleteSteps
source: Have you completed all the steps above?
vi: Bạn đã hoàn thành tất cả các bước trên chưa?

source: Yes, continue
vi: Có, tiếp tục

source: Success
vi: Thành Công

# formSubmitted
source: Form submitted successfully.
vi: Form đã được gửi thành công.

source: No Form Available
vi: Không Có Form Khả Dụng

# noSavedForms
source: There are no saved forms for this working instruction yet.
vi: Hiện chưa có form nào được lưu cho hướng dẫn làm việc này.

source: Pending
vi: Chưa giải quyết

source: Date Start
vi: Ngày bắt đầu

# overDueTask
source: Task OverDue
vi: Công Việc Quá Hạn

source: Select Category
vi: Chọn danh mục

# show
source: Showing
vi: HIển thị

# cavityLavel
source: Cavity
vi: Khoang

source: List Equipment
vi: Danh sách Thiết bị

source: Master Plan
vi: Kế Hoạch Chính

source: Current Count
vi: Hiện tại

source: Next Count
vi: Tiếp theo

source: Est Date
vi: Ngày ước tính

source: Manufacturer Date
vi: Ngày Sản Xuất

source: List Instructions
vi: Danh sách Hướng dẫn

source: Profile
vi: Hồ sơ

source: Home
vi: Trang chủ

source: Instructions
vi: Hướng dẫn

# languageSection
source: Language
vi: Ngôn ngữ

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

# englishDisplay
source: 🇺🇸 English
vi: 🇺🇸 Tiếng Anh

# chinese
source: Simplified Chinese
vi: Tiếng Trung

# chineseDisplay
source: 🇨🇳 中文（简体）
vi: 🇨🇳 Tiếng Trung (Giản thể)

# taiwanese
source: Traditional Chinese
vi: Tiếng Đài Loan

# taiwaneseDisplay
source: 🇹🇼 中文（繁體）
vi: 🇹🇼 Tiếng Trung (Phồn thể)

# notificationsSection
source: Notifications
vi: Thông báo

source: Push Notifications
vi: Thông báo đẩy

# receiveNotifications
source: Receive notifications on your device
vi: Nhận thông báo trên thiết bị của bạn

source: Sign Out
vi: Đăng xuất

# signOutConfirmTitle
source: Sign Out
vi: Đăng xuất

# signOutConfirmMessage
source: Are you sure you want to sign out?
vi: Bạn có chắc chắn muốn đăng xuất không?

# errorLogin
source: You need to login
vi: Bạn cần phải đăng nhập

source: In progress
vi: Đang thực hiện

# loginTitle
source: Login
vi: Đăng nhập

# usernameLabel
source: Username
vi: Tên đăng nhập

# passwordLabel
source: Password
vi: Mật khẩu

# otpCodeLabel
source: OTP Code
vi: Mã OTP

source: Get OTP
vi: Lấy mã OTP

# loginButton
source: Login
vi: Đăng nhập

# errorEmptyFields
source: Please enter all required fields
vi: Vui lòng nhập đầy đủ thông tin

# errorUnableConnect
source: Unable to connect to server
vi: Không thể kết nối đến máy chủ

# errorCannotOpenOtpApp
source: Cannot open OTP application
vi: Không thể mở ứng dụng OTP

# bottomButtonInstructions
source: Instructions
vi: Hướng dẫn

# systemCoolingTower
source: Cooling Tower
vi: Tháp giải nhiệt

# systemChiller
source: Chiller
vi: Máy làm lạnh

# systemVacuumTank
source: Vacuum Tank
vi: Bình chân không

# systemAirDryer
source: Air Dryer
vi: Máy sấy khí

# systemCompressor
source: Compressor
vi: Máy nén khí

# systemEndAirPressure
source: End Air Pressure
vi: Áp suất cuối

# systemAirTank
source: Air Tank
vi: Bình chứa khí

# systemAirConditioner
source: Air Conditioner
vi: Điều hòa không khí

# systemFactoryTemperature
source: Factory Temperature
vi: Nhiệt độ nhà xưởng

# tabIssue
source: Issue
vi: Vấn đề

# statusConnected
source: Connected
vi: Đang kết nối

# statusDisconnected
source: Disconnected
vi: Mất kết nối

# updateDialogTitle
source: Version: {version}
vi: Phiên bản {version}

# updateDescription
source: A new update is available!
vi: Đã có bản cập nhật mới!

source: Update now
vi: Cập nhật ngay

# downloadingTitle
source: Downloading...
vi: Đang tải xuống...

# cmmsDescription
source: Computerized Maintenance Management System
vi: Hệ thống quản lý bảo trì

# emsDescription
source: Equipment Management System
vi: Hệ thống quản lý thiết bị

# fmcsDescription
source: Facility Management Control System
vi: Hệ thống kiểm soát và quản lý cơ sở hạ tầng

# appVersion
source: Version {appVersion}
vi: Phiên bản {appVersion}

# typeDaily
source: Daily Inspection
vi: Hàng ngày

# level1
source: LV 1
vi: Bảo trì mức 1

# level2
source: LV 2
vi: Bảo trì mức 2

# level3
source: LV 3
vi: Bảo trì mức 3
